; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	thermograph2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star6 - direction
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph1)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star5)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
)
(:goal (and
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 thermograph2)
	(have_image Planet9 thermograph1)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 thermograph1)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star0 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star0)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet12)
   goals met: 0 of 7
5. (take_image satellite1 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 1 of 7
6. (turn_to satellite1 planet11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet11)
   goals met: 1 of 7
7. (take_image satellite1 planet11 instrument2 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 2 of 7
9. (take_image satellite1 planet10 instrument2 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 7
10. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 7
11. (take_image satellite1 phenomenon8 instrument2 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 4 of 7
12. (turn_to satellite1 planet13 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet13)
   goals met: 4 of 7
13. (take_image satellite1 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 5 of 7
14. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 5 of 7
15. (take_image satellite1 planet7 instrument2 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 6 of 7
16. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 6 of 7
17. (take_image satellite1 planet9 instrument2 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 7
